---
title: CompoundStructureLayer
classe: Autodesk.Revit.DB.CompoundStructureLayer
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# CompoundStructureLayer

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `StructDeckEmbeddingType DeckEmbeddingType { get; set; }` | `compoundStructureLayer.DeckEmbeddingType` | StructDeckEmbeddingType |
| `ElementId DeckProfileId { get; set; }` | `compoundStructureLayer.DeckProfileId` | ElementId |
| `MaterialFunctionAssignment Function { get; set; }` | `compoundStructureLayer.Function` | MaterialFunctionAssignment |
| `Boolean IsValidObject { get; }` | `compoundStructureLayer.IsValidObject` | Boolean |
| `Boolean LayerCapFlag { get; set; }` | `compoundStructureLayer.LayerCapFlag` | Boolean |
| `Int32 LayerId { get; }` | `compoundStructureLayer.LayerId` | Int32 |
| `ElementId MaterialId { get; set; }` | `compoundStructureLayer.MaterialId` | ElementId |
| `Double Width { get; set; }` | `compoundStructureLayer.Width` | Double |
| `Void Dispose()` | `compoundStructureLayer.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```